tutorials/flow_past_sphere_wedge/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     stokesFoam;  //steady state solver - no time derivatives

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          1;  // no time steps - instead iteration steps always set to 1 in simpleFoam

writeControl    timeStep; //runTime

writeInterval   1000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{

//forces1
//{
//    type                forces;
//    libs                ("libforces.so");
//    //writeControl        timeStep;
//    //writeInterval       1000;
//    patches             (sphereWall);
//    rho                 rhoInf;     // Indicates incompressible
//    rhoInf              1;          // Redundant for incompressible
//    pRef                0;
//    origin              (0 0 0);
//    e1                  (1 0 0);            // Replace with the correct direction for e1 (x-axis)
//    e2                  (0 1 0);            // Replace with the correct direction for e2 (y-axis)
//    e3                  (0 0 1);
//    // Store and write volume field representations of forces and moments
//    writeFields     yes;
//}

wallShearStress1
{
    // Mandatory entries (unmodifiable)
    type            wallShearStress;
    libs            (fieldFunctionObjects);

    // Optional entries (runtime modifiable)
    patches         (sphereWall);
    writeControl    timeStep;
    writeInterval   1000;

}

}
// ************************************************************************* //
