tutorials/flow_past_sphere_wedge/system/blockMeshDict
/*-----------------cc---------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

//x levels
x_13_17 #calc "0.5*cos(M_PI/4)";
x_7_14_5_18 #calc "1*cos(M_PI/4)";

//y levels
y_13_17 #calc "0.5*sin(M_PI/4)";
y_9_14_18_3 #calc "1*sin(M_PI/4)";
y_15 #calc "0.5*sin(M_PI/2)";
y_16 #calc "1*sin(M_PI/2)";

//z levels
z_13_17 #calc "-0.5*sin(M_PI/4)*tan(M_PI/180)";
z_32_36 #calc "0.5*sin(M_PI/4)*tan(M_PI/180)";

z_9_14_18_3 #calc "-sin(M_PI/4)*tan(M_PI/180)";
z_28_33_37_22 #calc "sin(M_PI/4)*tan(M_PI/180)";

z_15 #calc "-0.5*sin(M_PI/2)*tan(M_PI/180)";
z_34 #calc "0.5*sin(M_PI/2)*tan(M_PI/180)";

z_16 #calc "-1*sin(M_PI/2)*tan(M_PI/180)";
z_35 #calc "1*sin(M_PI/2)*tan(M_PI/180)";

z_8_7_6_5_4 #calc "-5*tan(M_PI/180)";
z_27_26_25_24_23 #calc "5*tan(M_PI/180)";

//x interpolation
interp_1_1_x #calc "0.5*cos(22.5*M_PI/180)";
interp_1_2_x #calc "1*cos(22.5*M_PI/180)";
interp_2_1_x #calc "0.5*cos(67.5*M_PI/180)";
interp_2_2_x #calc "1*cos(67.5*M_PI/180)";

//y interpolation
interp_1_1_y #calc "0.5*sin(22.5*M_PI/180)";
interp_1_2_y #calc "1*sin(22.5*M_PI/180)";
interp_2_1_y #calc "0.5*sin(67.5*M_PI/180)";
interp_2_2_y #calc "1*sin(67.5*M_PI/180)";

//z interpolation
interp_1_1_z1 #calc "-0.5*sin(22.5*M_PI/180)*tan(M_PI/180)";
interp_1_2_z1 #calc "-1*sin(22.5*M_PI/180)*tan(M_PI/180)";
interp_2_1_z1 #calc "-0.5*sin(67.5*M_PI/180)*tan(M_PI/180)";
interp_2_2_z1 #calc "-1*sin(67.5*M_PI/180)*tan(M_PI/180)";

interp_1_1_z2 #calc "0.5*sin(22.5*M_PI/180)*tan(M_PI/180)";
interp_1_2_z2 #calc "1*sin(22.5*M_PI/180)*tan(M_PI/180)";
interp_2_1_z2 #calc "0.5*sin(67.5*M_PI/180)*tan(M_PI/180)";
interp_2_2_z2 #calc "1*sin(67.5*M_PI/180)*tan(M_PI/180)";

vertices
(
    (0.5 0 0)                                  //0
    (1 0 0)                                    //1
    (5 0 0) //                                    //2
    (5 $y_9_14_18_3 $z_9_14_18_3)//              //3
    (5 5 $z_8_7_6_5_4)//                         //4
    ($x_7_14_5_18 5 $z_8_7_6_5_4)              //5
    (0 5 $z_8_7_6_5_4)                       //6
    (-$x_7_14_5_18 5 $z_8_7_6_5_4)             //7
    (-5 5 $z_8_7_6_5_4)//                        //8
    (-5 $y_9_14_18_3 $z_9_14_18_3)//             //9
    (-5 0 0)//                                   //10
    (-1 0 0)                                   //11
    (-0.5 0 0)                                 //12
    (-$x_13_17 $y_13_17 $z_13_17)              //13
    (-$x_7_14_5_18 $y_9_14_18_3 $z_9_14_18_3)  //14
    (0 $y_15 $z_15)                            //15
    (0 $y_16 $z_16)                            //16
    ($x_13_17 $y_13_17 $z_13_17)               //17
    ($x_7_14_5_18 $y_9_14_18_3 $z_9_14_18_3)   //18
    (0.5 0 0)                                  //19
    (1 0 0)                                    //20
    (5 0 0)//                                    //21
    (5 $y_9_14_18_3 $z_28_33_37_22)//            //22
    (5 5 $z_27_26_25_24_23)//                     //23
    ($x_7_14_5_18 5 $z_27_26_25_24_23)          //24
    (0 5 $z_27_26_25_24_23)                    //25
    (-$x_7_14_5_18 5 $z_27_26_25_24_23)         //26
    (-5 5 $z_27_26_25_24_23)//                    //27
    (-5 $y_9_14_18_3 $z_28_33_37_22)//           //28
    (-5 0 0)//                                   //29
    (-1 0 0)                                   //30
    (-0.5 0 0)                                 //21
    (-$x_13_17 $y_13_17 $z_32_36)              //32
    (-$x_7_14_5_18 $y_9_14_18_3 $z_28_33_37_22)//33
    (0 $y_15 $z_34)                            //34
    (0 $y_16 $z_35)                            //35
    ($x_13_17 $y_13_17 $z_32_36)               //36
    ($x_7_14_5_18 $y_9_14_18_3 $z_28_33_37_22) //37

);

blocks
(
    hex (9 14 7 8 28 33 26 27) (500 500 1) simpleGrading (1 1 1)    //block 0
    hex (10 11 14 9 29 30 33 28) (500 100 1) simpleGrading (1 1 1)  //block 1
    hex (11 12 13 14 30 31 32 33) (100 100 1) simpleGrading (1 1 1)   //block 2
    hex (13 15 16 14 32 34 35 33) (100 100 1) simpleGrading (1 1 1)     //block 3
    hex (14 16 6 7 33 35 25 26) (100 500 1) simpleGrading (1 1 1)      //block 4
    hex (16 18 5 6 35 37 24 25) (100 500 1) simpleGrading (1 1 1)       //block 5
    hex (15 17 18 16 34 36 37 35) (100 100 1) simpleGrading (1 1 1)      //block 6
    hex (17 0 1 18 36 19 20 37) (100 100 1) simpleGrading (1 1 1)      //block 7
    hex (1 2 3 18 20 21 22 37) (500 100 1) simpleGrading (1 1 1)      //block 8
    hex (18 3 4 5 37 22 23 24) (500 500 1) simpleGrading (1 1 1)      //block 9

);

edges
(
    arc 0 17 ($interp_1_1_x $interp_1_1_y $interp_1_1_z1)
    arc 17 15 ($interp_2_1_x $interp_2_1_y $interp_2_1_z1)
    arc 15 13 (-$interp_2_1_x $interp_2_1_y $interp_2_1_z1)
    arc 13 12 (-$interp_1_1_x $interp_1_1_y $interp_1_1_z1)
    arc 18 1 ($interp_1_2_x $interp_1_2_y $interp_1_2_z1)
    arc 16 18 ($interp_2_2_x $interp_2_2_y $interp_2_2_z1)
    arc 14 16 (-$interp_2_2_x $interp_2_2_y $interp_2_2_z1)
    arc 11 14 ($interp_1_2_x $interp_1_2_y $interp_1_2_z1)
    arc 19 36 ($interp_1_1_x $interp_1_1_y $interp_1_1_z2)
    arc 36 34 ($interp_2_1_x $interp_2_1_y $interp_2_1_z2)
    arc 34 32 (-$interp_2_1_x $interp_2_1_y $interp_2_1_z2)
    arc 32 31 (-$interp_1_1_x $interp_1_1_y $interp_1_1_z2)
    arc 37 20 ($interp_1_2_x $interp_1_2_y $interp_1_2_z2)
    arc 35 37 ($interp_2_2_x $interp_2_2_y $interp_2_2_z2)
    arc 33 35 (-$interp_2_2_x $interp_2_2_y $interp_2_2_z2)
    arc 30 33 ($interp_1_2_x $interp_1_2_y $interp_1_2_z2)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (8 9 27 28)
            (9 10 28 29)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 3 21 22)
            (3 4 22 23)
        );
    }
    cylenderWall
    {
        type wall;
        faces
        (
            (4 5 23 24)
            (5 6 24 25)
            (6 7 25 26)
            (7 8 26 27)
        );
    }
    sphereWall
    {
        type wall;
        faces
        (
            (12 13 31 32)
            (13 15 32 34)
            (15 17 34 36)
            (17 0 36 19)
        );
    }
    frontWedge
    {
        type wedge;
        faces
        (
            (9 14 7 8)
            (10 11 14 9)
            (11 12 13 14)
            (13 15 16 14)
            (14 16 6 7)
            (16 18 5 6)
            (15 17 18 16)
            (17 0 1 18)
            (1 2 3 18)
            (18 3 4 5)
        );
    }
    backWedge
    {
        type wedge;
        faces
        (
            (28 33 26 27)
            (29 30 33 28)
            (30 31 32 33)
            (32 34 35 33)
            (33 35 25 26)
            (35 37 24 25)
            (34 36 37 35)
            (36 19 20 37)
            (20 21 22 37)
            (37 22 23 24)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
